## Staging: ecr
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 0 to change, 1 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.form_viewer_policy will be created
  + resource "aws_ecr_lifecycle_policy" "form_viewer_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 30
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "form_viewer_staging"
    }

  # aws_ecr_lifecycle_policy.load_test_policy will be created
  + resource "aws_ecr_lifecycle_policy" "load_test_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 5 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 5
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "load_test"
    }

  # aws_ecr_lifecycle_policy.policy will be destroyed
  # (because aws_ecr_lifecycle_policy.policy is not in configuration)
  - resource "aws_ecr_lifecycle_policy" "policy" {
      - id          = "form_viewer_staging" -> null
      - policy      = jsonencode(
            {
              - rules = [
                  - {
                      - action       = {
                          - type = "expire"
                        }
                      - description  = "Keep last 30 images"
                      - rulePriority = 1
                      - selection    = {
                          - countNumber   = 30
                          - countType     = "imageCountMoreThan"
                          - tagPrefixList = [
                              - "v",
                            ]
                          - tagStatus     = "tagged"
                        }
                    },
                ]
            }
        ) -> null
      - registry_id = "687401027353" -> null
      - repository  = "form_viewer_staging" -> null
    }

  # aws_ecr_repository.load_test_repository will be created
  + resource "aws_ecr_repository" "load_test_repository" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "load_test"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 3 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  - ecr_repository_url             = "687401027353.dkr.ecr.ca-central-1.amazonaws.com/form_viewer_staging" -> null
  + ecr_repository_url_form_viewer = "687401027353.dkr.ecr.ca-central-1.amazonaws.com/form_viewer_staging"
  + ecr_repository_url_load_test   = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
